---
kind: type
id: T:Autodesk.Revit.DB.Electrical.DistributionSysType
source: html/03754b33-fd20-b19b-a718-6dc2eeccd76c.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysType

Represents a specific type of distribution system.

## Syntax (C#)
```csharp
public class DistributionSysType : ElementType
```